iarsystems/ewarm-toshiba-example-projects/TMPM4G8/Libraries/TMPM4G8.h
/**
 *******************************************************************************
 * @file    TMPM4G8.h
 * @brief   CMSIS Cortex-M4 Core Peripheral Access Layer Header File for the
 *          TOSHIBA 'TMPM4G8' Device Series
 * @version V1.0.6.0
 * $Date:: 2017-09-26 #$
 * 
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LISENCE AGREEMENT.
 * 
 * (C)Copyright TOSHIBA MICROELECTRONICS CORPORATION 2017 All rights reserved
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TXZ_MICROCONTROLLER
  * @{
  */
  
/** @addtogroup TMPM4G8
  * @{
  */

#ifndef __TMPM4G8_H__
#define __TMPM4G8_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M4 Processor Exceptions Numbers ***************************************************************/
  NonMaskableInt_IRQn           = -14,       /*!< 2 Non Maskable Interrupt                                    */
  HardFault_IRQn                = -13,       /*!< 3 Cortex-M4 Hard Fault Interrupt                            */
  MemoryManagement_IRQn         = -12,       /*!< 4 Cortex-M4 Memory Management Interrupt                     */
  BusFault_IRQn                 = -11,       /*!< 5 Cortex-M4 Bus Fault Interrupt                             */
  UsageFault_IRQn               = -10,       /*!< 6 Cortex-M4 Usage Fault Interrupt                           */
  SVCall_IRQn                   = -5,        /*!< 11 Cortex-M4 SV Call Interrupt                              */
  DebugMonitor_IRQn             = -4,        /*!< 12 Cortex-M4 Debug Monitor Interrupt                        */
  PendSV_IRQn                   = -2,        /*!< 14 Cortex-M4 Pend SV Interrupt                              */
  SysTick_IRQn                  = -1,        /*!< 15 Cortex-M4 System Tick Interrupt                          */

/******  TMPM4G8 Specific Interrupt Numbers *******************************************************************/
  INT00_IRQn                    = 0,         /*!< Interrupt pin 00a/00b                                       */
  INT01_IRQn                    = 1,         /*!< Interrupt pin 01a/00b                                       */
  INT02_IRQn                    = 2,         /*!< Interrupt pin 02a/00b                                       */
  INT03_IRQn                    = 3,         /*!< Interrupt pin 03a/03b                                       */
  INT04_IRQn                    = 4,         /*!< Interrupt pin 04a/04b                                       */
  INT05_IRQn                    = 5,         /*!< Interrupt pin 05a/05b                                       */
  INT06_IRQn                    = 6,         /*!< Interrupt pin 06a/06b                                       */
  INT07_IRQn                    = 7,         /*!< Interrupt pin 07a/07b                                       */
  INT08_IRQn                    = 8,         /*!< Interrupt pin 08a/08b                                       */
  INT09_IRQn                    = 9,         /*!< Interrupt pin 09a/09b                                       */
  INT10_IRQn                    = 10,        /*!< Interrupt pin 10a/10b                                       */
  INT11_IRQn                    = 11,        /*!< Interrupt pin 11a/11b                                       */
  INT12_IRQn                    = 12,        /*!< Interrupt pin 12a/12b                                       */
  INT13_IRQn                    = 13,        /*!< Interrupt pin 13a/13b                                       */
  INT14_IRQn                    = 14,        /*!< Interrupt pin 14a/14b                                       */
  INT15_IRQn                    = 15,        /*!< Interrupt pin 15a/15b                                       */
  INTRTC_IRQn                   = 16,        /*!< Real time clock(XHz) interrupt                              */
  INTCEC0RX_IRQn                = 17,        /*!< CEC reception interrupt (channel 0)                         */
  INTCEC0TX_IRQn                = 18,        /*!< CEC transmission interrupt (channel 0)                      */
  INTISDA_IRQn                  = 19,        /*!< Interval Sensing Detector Interrupt (Unit A)                */
  INTISDB_IRQn                  = 20,        /*!< Interval Sensing Detector Interrupt (Unit B)                */
  INTRMC0_IRQn                  = 22,        /*!< Remote control reception interrupt 0                        */
  INTRMC1_IRQn                  = 23,        /*!< Remote control reception interrupt 1                        */
  INTLTTMR_IRQn                 = 24,        /*!< Long Term Timer Interrupt                                   */
  INTHDMAATC_IRQn               = 25,        /*!< HDMA Complete of transfer(Unit A)                           */
  INTHDMAAERR_IRQn              = 26,        /*!< HDMA transfer error(Unit A)                                 */
  INTHDMABTC_IRQn               = 27,        /*!< HDMA end of transfer(Unit B)                                */
  INTHDMABERR_IRQn              = 28,        /*!< HDMA transfer error(Unit B)                                 */
  INTMDMAATC_IRQn               = 29,        /*!< MDMA Complete of transfer(Unit A)                           */
  INTT32A00_A_CT_IRQn           = 30,        /*!< T32A00 TimerA All Interrupt/Timer Interrupt C               */
  INTT32A00_B_C01_CPC_IRQn      = 31,        /*!< T32A00 Timer Interrupt B/Capture C0,C1 Interrupt/ Timer Interrupt C*/
  INTT32A01_A_CT_IRQn           = 32,        /*!< T32A01 TimerA All Interrupt/Timer Interrupt C               */
  INTT32A01_B_C01_CPC_IRQn      = 33,        /*!< T32A01 Timer Interrupt B/Capture C0,C1 Interrupt/ Timer Interrupt C*/
  INTT32A02_A_CT_IRQn           = 34,        /*!< T32A02 TimerA All Interrupt/Timer Interrupt C               */
  INTT32A02_B_C01_CPC_IRQn      = 35,        /*!< T32A02 Timer Interrupt B/Capture C0,C1 Interrupt/ Timer Interrupt C*/
  INTT32A03_A_CT_IRQn           = 36,        /*!< T32A03 TimerA All Interrupt/Timer Interrupt C               */
  INTT32A03_B_C01_CPC_IRQn      = 37,        /*!< T32A03 Timer Interrupt B/Capture C0,C1 Interrupt/ Timer Interrupt C*/
  INTT32A04_A_CT_IRQn           = 38,        /*!< T32A04 TimerA All Interrupt/Timer Interrupt C               */
  INTT32A04_B_C01_CPC_IRQn      = 39,        /*!< T32A04 Timer Interrupt B/Capture C0,C1 Interrupt/ Timer Interrupt C*/
  INTT32A05_A_CT_IRQn           = 40,        /*!< T32A05 TimerA All Interrupt/Timer Interrupt C               */
  INTT32A05_B_C01_CPC_IRQn      = 41,        /*!< T32A05 Timer Interrupt B/Capture C0,C1 Interrupt/ Timer Interrupt C*/
  INTT32A06_A_CT_IRQn           = 42,        /*!< T32A06 TimerA All Interrupt/Timer Interrupt C               */
  INTT32A06_B_C01_CPC_IRQn      = 43,        /*!< T32A06 Timer Interrupt B/Capture C0,C1 Interrupt/ Timer Interrupt C*/
  INTT32A07_A_CT_IRQn           = 44,        /*!< T32A07 TimerA All Interrupt/Timer Interrupt C               */
  INTT32A07_B_C01_CPC_IRQn      = 45,        /*!< T32A07 Timer Interrupt B/Capture C0,C1 Interrupt/ Timer Interrupt C*/
  INTT32A08_A_CT_IRQn           = 46,        /*!< T32A08 TimerA All Interrupt/Timer Interrupt C               */
  INTT32A08_B_C01_CPC_IRQn      = 47,        /*!< T32A08 Timer Interrupt B/Capture C0,C1 Interrupt/ Timer Interrupt C*/
  INTT32A09_A_CT_IRQn           = 48,        /*!< T32A09 TimerA All Interrupt/Timer Interrupt C               */
  INTT32A09_B_C01_CPC_IRQn      = 49,        /*!< T32A09 Timer Interrupt B/Capture C0,C1 Interrupt/ Timer Interrupt C*/
  INTT32A10_A_CT_IRQn           = 50,        /*!< T32A10 TimerA All Interrupt/Timer Interrupt C               */
  INTT32A10_B_C01_CPC_IRQn      = 51,        /*!< T32A10 Timer Interrupt B/Capture C0,C1 Interrupt/ Timer Interrupt C*/
  INTT32A11_A_CT_IRQn           = 52,        /*!< T32A11 TimerA All Interrupt/Timer Interrupt C               */
  INTT32A11_B_C01_CPC_IRQn      = 53,        /*!< T32A11 Timer Interrupt B/Capture C0,C1 Interrupt/ Timer Interrupt C*/
  INTT32A12_A_CT_IRQn           = 54,        /*!< T32A12 TimerA All Interrupt/Timer Interrupt C               */
  INTT32A12_B_C01_CPC_IRQn      = 55,        /*!< T32A12 Timer Interrupt B/Capture C0,C1 Interrupt/ Timer Interrupt C*/
  INTT32A13_A_CT_IRQn           = 56,        /*!< T32A13 TimerA All Interrupt/Timer Interrupt C               */
  INTT32A13_B_C01_CPC_IRQn      = 57,        /*!< T32A13 Timer Interrupt B/Capture C0,C1 Interrupt/ Timer Interrupt C*/
  INTEMG0_IRQn                  = 58,        /*!< PMD0 EMG interrupt                                          */
  INTOVV0_IRQn                  = 59,        /*!< PMD0 OVV interrupt                                          */
  INTPWM0_IRQn                  = 60,        /*!< PMD0 interrupt                                              */
  INTT0RX_IRQn                  = 61,        /*!< TSPI/SIO reception (channel 0)                              */
  INTT0TX_IRQn                  = 62,        /*!< TSPI/SIO transmit (channel 0)                               */
  INTT0ERR_IRQn                 = 63,        /*!< TSPI/SIO error (channel 0)                                  */
  INTT1RX_IRQn                  = 64,        /*!< TSPI/SIO reception (channel 1)                              */
  INTT1TX_IRQn                  = 65,        /*!< TSPI/SIO transmit (channel 1)                               */
  INTT1ERR_IRQn                 = 66,        /*!< TSPI/SIO error (channel 1)                                  */
  INTT2RX_IRQn                  = 67,        /*!< TSPI/SIO reception (channel 2)                              */
  INTT2TX_IRQn                  = 68,        /*!< TSPI/SIO transmit (channel 2)                               */
  INTT2ERR_IRQn                 = 69,        /*!< TSPI/SIO error (channel 2)                                  */
  INTT3RX_IRQn                  = 70,        /*!< TSPI/SIO reception (channel 3)                              */
  INTT3TX_IRQn                  = 71,        /*!< TSPI/SIO transmit (channel 3)                               */
  INTT3ERR_IRQn                 = 72,        /*!< TSPI/SIO error (channel 3)                                  */
  INTT4RX_IRQn                  = 73,        /*!< TSPI/SIO reception (channel 4)                              */
  INTT4TX_IRQn                  = 74,        /*!< TSPI/SIO transmit (channel 4)                               */
  INTT4ERR_IRQn                 = 75,        /*!< TSPI/SIO error (channel 4)                                  */
  INTT5RX_IRQn                  = 76,        /*!< TSPI/SIO reception (channel 5)                              */
  INTT5TX_IRQn                  = 77,        /*!< TSPI/SIO transmit (channel 5)                               */
  INTT5ERR_IRQn                 = 78,        /*!< TSPI/SIO error (channel 5)                                  */
  INTT6RX_IRQn                  = 79,        /*!< TSPI/SIO reception (channel 6)                              */
  INTT6TX_IRQn                  = 80,        /*!< TSPI/SIO transmit (channel 6)                               */
  INTT6ERR_IRQn                 = 81,        /*!< TSPI/SIO error (channel 6)                                  */
  INTT7RX_IRQn                  = 82,        /*!< TSPI/SIO reception (channel 7)                              */
  INTT7TX_IRQn                  = 83,        /*!< TSPI/SIO transmit (channel 7)                               */
  INTT7ERR_IRQn                 = 84,        /*!< TSPI/SIO error (channel 7)                                  */
  INTSMI0_IRQn                  = 88,        /*!< Serial Memory Interface Interrupt                           */
  INTUART0RX_IRQn               = 89,        /*!< UART reception (channel 0)                                  */
  INTUART0TX_IRQn               = 90,        /*!< UART transmit (channel 0)                                   */
  INTUART0ERR_IRQn              = 91,        /*!< UART error (channel 0)                                      */
  INTUART1RX_IRQn               = 92,        /*!< UART reception (channel 1)                                  */
  INTUART1TX_IRQn               = 93,        /*!< UART transmit (channel 1)                                   */
  INTUART1ERR_IRQn              = 94,        /*!< UART error (channel 1)                                      */
  INTUART2RX_IRQn               = 95,        /*!< UART reception (channel 2)                                  */
  INTUART2TX_IRQn               = 96,        /*!< UART transmit (channel 2)                                   */
  INTUART2ERR_IRQn              = 97,        /*!< UART error (channel 2)                                      */
  INTUART3RX_IRQn               = 98,        /*!< UART reception (channel 3)                                  */
  INTUART3TX_IRQn               = 99,        /*!< UART transmit (channel 3)                                   */
  INTUART3ERR_IRQn              = 100,       /*!< UART error (channel 3)                                      */
  INTUART4RX_IRQn               = 101,       /*!< UART reception (channel 4)                                  */
  INTUART4TX_IRQn               = 102,       /*!< UART transmit (channel 4)                                   */
  INTUART4ERR_IRQn              = 103,       /*!< UART error (channel 4)                                      */
  INTFUART0_IRQn                = 107,       /*!< FUART Interrupt(channel 0)                                  */
  INTFUART1_IRQn                = 108,       /*!< FUART Interrupt(channel 1)                                  */
  INTI2C0_IRQn                  = 109,       /*!< I2C0 transmission and reception interrupt                   */
  INTI2C0AL_IRQn                = 110,       /*!< I2C0 arbitration lost interrupt                             */
  INTI2C0BF_IRQn                = 111,       /*!< I2C0 bus free interrupt                                     */
  INTI2C0NACK_IRQn              = 112,       /*!< I2C0 no ack interrupt                                       */
  INTI2C1_IRQn                  = 113,       /*!< I2C1 transmission and reception interrupt                   */
  INTI2C1AL_IRQn                = 114,       /*!< I2C1 arbitration lost interrupt                             */
  INTI2C1BF_IRQn                = 115,       /*!< I2C1 bus free interrupt                                     */
  INTI2C1NACK_IRQn              = 116,       /*!< I2C1 no ack interrupt                                       */
  INTI2C2_IRQn                  = 117,       /*!< I2C2 transmission and reception interrupt                   */
  INTI2C2AL_IRQn                = 118,       /*!< I2C2 arbitration lost interrupt                             */
  INTI2C2BF_IRQn                = 119,       /*!< I2C2 bus free interrupt                                     */
  INTI2C2NACK_IRQn              = 120,       /*!< I2C2 no ack interrupt                                       */
  INTI2C3_IRQn                  = 121,       /*!< I2C3 transmission and reception interrupt                   */
  INTI2C3AL_IRQn                = 122,       /*!< I2C3 arbitration lost interrupt                             */
  INTI2C3BF_IRQn                = 123,       /*!< I2C3 bus free interrupt                                     */
  INTI2C3NACK_IRQn              = 124,       /*!< I2C3 no ack interrupt                                       */
  INTI2C4_IRQn                  = 125,       /*!< I2C4 transmission and reception interrupt                   */
  INTI2C4AL_IRQn                = 126,       /*!< I2C4 arbitration lost interrupt                             */
  INTI2C4BF_IRQn                = 127,       /*!< I2C4 bus free interrupt                                     */
  INTI2C4NACK_IRQn              = 128,       /*!< I2C4 no ack interrupt                                       */
  INTADACP0_IRQn                = 129,       /*!< ADC conversion monitoring function interrupt 0              */
  INTADACP1_IRQn                = 130,       /*!< ADC conversion monitoring function interrupt 1              */
  INTADATRG_IRQn                = 131,       /*!< ADC conversion triggered by General purpose is finished     */
  INTADASGL_IRQn                = 132,       /*!< ADC conversion triggered by Single program is finished      */
  INTADACNT_IRQn                = 133,       /*!< ADC conversion triggered by Continuity program is finished  */
  INTADAHP_IRQn                 = 134,       /*!< ADC High Priority AD conversion interrupt                   */
  INTFLDRDY_IRQn                = 135,       /*!< Data FLASH Ready interrupt                                  */
  INTFLCRDY0_IRQn               = 136,       /*!< Code FLASH Area0/1 Ready interrupt                          */
  INTFLCRDY1_IRQn               = 137,       /*!< Code FLASH Area2 Ready interrupt                            */
  INTMDMAABERR_IRQn             = 139,       /*!< MDMA bus error(Unit A)                                      */
  INTMDMAADERR_IRQn             = 140        /*!< MDMA descriptor error(Unit A)                               */
} IRQn_Type;

